/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   set_utils.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tishihar <tishihar@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2025/05/08 15:47:12 by tishihar          #+#    #+#             */
/*   Updated: 2025/05/08 16:52:13 by tishihar         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "minirt.h"

// 有効文字は符号、数字、カンマ、小数点のみ
// 現状、,,,.,.0.8とかそのまま入力されるので　０として解釈されそう

// double_set
// スペースか塗る終端が終わりなことに注意
double	parse_d(char *elem)
{
	return (ft_atof(elem));
}
